ModelRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
  <soap:Header/>
  <soap:Body>
    <GenerarCodigoDeBarrasDePago xmlns="http://tempuri.org/">
      <Nombre>Carlos Armando</Nombre>
      <Apellido>Mulet</Apellido>
      <ImpuestoAbonar>100000</ImpuestoAbonar>
      <TipoDocumento>6</TipoDocumento>
      <NroDocumento>33688645</NroDocumento>
      <Caratula>Mulet Carlos Armando</Caratula>
      <BaseImponible>500.3</BaseImponible>
      <idOrganismo>3</idOrganismo>
      <LetraReceptoria>ZC</LetraReceptoria>
      <NumeroReceptoria>3420</NumeroReceptoria>
      <SufijoReceptoria>2018</SufijoReceptoria>
      <DetalleError>?</DetalleError>
    </GenerarCodigoDeBarrasDePago>
  </soap:Body>
</soap:Envelope>